<?php
  use PHPMailer\PHPMailer\PHPMailer;
  use PHPMailer\PHPMailer\Exception;

  require 'PHPMailer/src/PHPMailer.php';
  require 'PHPMailer/src/Exception.php';
  require 'PHPMailer/src/SMTP.php';

  $mail = new PHPMailer();
  $from = 'km@aggo.ru';
  $to = 'km@aggo.ru';
  $mail -> isSMTP(); 
  $mail -> Host = 'smtp.yandex.ru';
  $mail -> SMTPAuth = true;
  $mail -> Username = 'km@aggo.ru';
  $mail -> Password = '123123qaz';
  $mail -> SMTPSecure = 'ssl';
  $mail -> Port = '465';
  $mail -> CharSet = 'UTF-8';
  $mail -> setFrom($from);
  $mail -> addAddress($to);
  $mail -> isHTML (true);
  $mail -> Subject = 'Заявка на обратный звонок';

  $name = '';
  $phone = '';

  if(trim(!empty($_POST['name']))) {
    $name = $_POST['name'];
  }
  if(trim(!empty($_POST['phone']))) {
    $phone = $_POST['phone'];
  }

  $mail -> Body = "
    <html>
    <body>
      <h2>Перезвоните этому клиенту:</h2>
      <p><b>Имя</b>: $name</p>
      <p><b>Телефон</b>: $phone</p>
    </body>
    </html>
  ";

  // echo $mail -> Body;

  $mail -> SMTPDebug = 0;
  $mail -> AltBody = 'Текст альтернативного письма';

  if ($mail -> send()) {
    echo 'Сообщение отправлено';
  } else {
    echo 'Ошибка, письмо не может быть отправлено: '.$mail -> ErrorInfo;
  }











  // $mail2 = new PHPMailer();
  // $from2 = 'semrush@aggo.ru';
  // $to2 = 'stanli9@mail.ru';
  // $mail2 -> isSMTP(); 
  // $mail2 -> Host = 'smtp.yandex.ru';
  // $mail2 -> SMTPAuth = true;
  // $mail2 -> Username = 'semrush@aggo.ru';
  // $mail2 -> Password = 'hbanxtrbezmxizix';
  // $mail2 -> SMTPSecure = 'ssl';
  // $mail2 -> Port = '465';
  // $mail2 -> CharSet = 'UTF-8';
  // $mail2 -> setFrom($from2);
  // $mail -> addAddress($to2);
  // $mail2 -> isHTML (true);
  // $mail2 -> Subject = 'AGGO | Semrush. Подтверждение регистрации на вебинар.';

  // $mail2 -> Body = '
  // <!DOCTYPE html>
  // <html lang="en">
  // <head>
  //   <meta charset="UTF-8">
  //   <meta name="viewport" content="width=device-width, initial-scale=1.0">
  //   <title>Вебинар</title>
  //   <style>
  //     body {
  //       font-family: Arial, Helvetica, sans-serif;
  //       padding: 2% 4%;
  //     }
  //     p {
  //       margin: 1.5em 0;
  //     }
  //     .bottom {
  //       display: flex;
  //       justify-content: space-between;
  //       align-items: flex-start;
  //       font-size: 12px;
  //       max-width: 275px;
  //     }
  //     .bottom p {
  //       margin: 0;
  //       line-height: 1.4;
  //     }
  //     .bottom a {
  //       line-height: 1.4;
  //     }
  //     .bottom svg {
  //       padding-right: 15px;
  //       border-right: 1px solid grey;
  //     }
  //     .bottom__right {
  //       margin-left: 15px;
  //     }
  //   </style>
  // </head>
  // <body>
  //   <svg width="253" height="34" viewBox="0 0 253 34" fill="none" xmlns="http://www.w3.org/2000/svg">
  //     <path d="M173.99 13.2723C173.99 9.10498 171.453 6.07031 166.589 6.07031H150.877V27.6763H156.037V20.3033H162.148L168.133 27.6763H173.948V27.2061L168.133 20.1751C171.791 19.4271 173.99 16.7344 173.99 13.2723ZM166.018 15.9437H156.058V10.5582H166.018C167.858 10.5582 169.042 11.5413 169.042 13.2509C169.042 15.0034 167.9 15.9437 166.018 15.9437Z" fill="black"/>
  //     <path d="M252.001 6.07031H247.159V14.2767H234.154V6.07031H228.93V27.6977H234.154V19.1707H247.159V27.6977H252.001V6.07031Z" fill="black"/>
  //     <path d="M137.068 6.07031L131.316 24.2569H130.999L125.226 6.07031H116.027V27.6977H120.955V9.93845H121.251L127.002 27.6977H134.932L140.705 9.93845H141.001V27.6977H146.077V6.07031H137.068Z" fill="black"/>
  //     <path d="M80.8622 14.9181C79.0436 14.7258 75.639 14.4052 73.8204 14.2129C72.0229 14.0205 70.9867 13.4863 70.9867 12.2895C70.9867 11.1355 72.0864 10.1738 76.5271 10.1738C80.4604 10.1738 84.0764 11.0286 87.2273 12.5673V7.73749C84.0764 6.22015 80.5873 5.47217 76.2522 5.47217C70.162 5.47217 65.9539 8.03668 65.9539 12.3963C65.9539 16.0721 68.428 18.081 73.3763 18.6367C75.1737 18.829 78.2188 19.1068 80.3546 19.2778C82.6808 19.4701 83.3575 20.1967 83.3575 21.2653C83.3575 22.7399 81.7292 23.6374 77.6056 23.6374C73.4186 23.6374 69.1681 22.2483 66.1442 20.3036V25.283C68.576 26.9286 72.763 28.3177 77.4364 28.3177C84.0764 28.3177 88.348 25.7318 88.348 21.0943C88.3903 17.5895 86.1065 15.4738 80.8622 14.9181Z" fill="black"/>
  //     <path d="M91.7782 6.07031V27.6977H111.719V23.2739H96.7053V18.8929H111.466V14.5118H96.7053V10.4941H111.719V6.07031H91.7782Z" fill="black"/>
  //     <path d="M218.252 14.9176C216.434 14.7253 213.029 14.4047 211.211 14.2124C209.413 14.02 208.377 13.4858 208.377 12.289C208.377 11.135 209.477 10.1733 213.917 10.1733C217.851 10.1733 221.467 11.0281 224.617 12.5668V7.737C221.467 6.21966 217.977 5.47168 213.642 5.47168C207.552 5.47168 203.344 8.03619 203.344 12.3959C203.344 16.0717 205.818 18.0805 210.766 18.6362C212.564 18.8285 215.609 19.1063 217.745 19.2773C220.071 19.4696 220.748 20.1962 220.748 21.2648C220.748 22.7394 219.119 23.637 214.996 23.637C210.809 23.637 206.558 22.2478 203.534 20.3031V25.2825C205.966 26.9281 210.153 28.3172 214.827 28.3172C221.467 28.3172 225.738 25.7313 225.738 21.0938C225.781 17.589 223.497 15.4733 218.252 14.9176Z" fill="black"/>
  //     <path d="M194.676 6.07031V17.1404C194.676 21.3291 192.16 23.6372 188.375 23.6372C184.568 23.6372 182.073 21.3719 182.073 17.0763V6.07031H176.934V16.5848C176.934 24.4279 181.777 28.3174 188.459 28.3174C194.867 28.3174 199.836 24.5989 199.836 16.8412V6.07031H194.676Z" fill="black"/>
  //     <path d="M48.2775 16.7548C48.2775 17.802 47.7488 17.9729 46.4378 17.9729C45.0421 17.9729 44.7883 17.7379 44.6403 16.6693C44.3654 13.9552 42.5468 11.6471 39.5017 11.3907C38.529 11.3052 38.2964 10.9419 38.2964 9.72376C38.2964 8.59111 38.4655 8.05683 39.3325 8.05683C44.6192 8.0782 48.2775 12.3738 48.2775 16.7548ZM55.9748 16.7548C55.9748 8.61248 50.519 0 37.9157 0H12.8782C12.3707 0 12.0535 0.256451 12.0535 0.726611C12.0535 0.983062 12.2438 1.21814 12.413 1.34637C13.3223 2.07298 14.6757 2.88507 16.452 3.78265C18.186 4.65886 19.5394 5.23587 20.8928 5.79151C21.4637 6.0266 21.6752 6.28305 21.6752 6.60361C21.6752 7.0524 21.358 7.33022 20.7447 7.33022H0.867007C0.274904 7.33022 0 7.7149 0 8.09957C0 8.42014 0.105732 8.69796 0.380636 8.97578C1.98777 10.6855 4.56765 12.7371 8.31058 15.1092C11.5883 17.1822 15.6484 19.4262 18.8838 20.9862C19.4337 21.2427 19.6028 21.5419 19.6028 21.8624C19.5817 22.2257 19.3068 22.5249 18.6724 22.5249H9.55823C9.05071 22.5249 8.75466 22.8028 8.75466 23.2302C8.75466 23.4653 8.94498 23.7644 9.19874 23.9995C11.2711 25.9015 14.5911 27.9745 19.0107 29.8765C24.9106 32.4197 30.8951 33.937 37.6197 33.937C50.371 33.937 55.9748 24.2987 55.9748 16.7548ZM39.3325 28.7866C32.8194 28.7866 27.3636 23.4225 27.3636 16.7334C27.3636 10.1512 32.7983 4.8512 39.3325 4.8512C46.0148 4.8512 51.2592 10.1298 51.2592 16.7334C51.238 23.4225 46.0148 28.7866 39.3325 28.7866Z" fill="#FC6538"/>
  //     </svg>
      
  
  //   <p>Добрый день!</p>
  
  //   <p>Спасибо за регистрацию на вебинар. Мы вышлем ссылку на трансляцию за несколько дней до его старта отдельным письмом и потом еще раз напомним в день мероприятия.</p>
  
  //   <p>Также мы подготовили для вас ссылку-промокод на недельный триал сервиса Semrush в тарифе GURU + дополнение «Конкурентный анализ»: <a href="https://www.semrush.com/signup/promo/?promo=AGGOGURU1WEEK-YTRZLCXM">https://www.semrush.com/signup/promo/?promo=AGGOGURU1WEEK-YTRZLCXM</a>.</p>
  
  //   <p>Если у вас возникли проблемы при активации промокода, пожалуйста, зарегистрируйтесь по <a href="https://ru.semrush.com/signup/">этой ссылке</a> и сообщите нам логин аккаунта — тогда мы откроем пробный период вручную.</p>
  
  //   <p>В случае интереса к Semrush, мы будем рады провести личную демонстрацию и показать, как его можно использовать в контексте ваших задач. Выбрать удобное время для онлайн-демо можно здесь: <a href="https://calendly.com/semrush_demo/live">записаться на онлайн демо</a>.</p>
  
  //   <p>Приобретайте подписку Semrush на <a href="https://semrush.aggo.ru/">официальном сайте</a> российского реселлера или через прямой договор.</p>
  
  //   <p>С любыми вопросами — смело обращайтесь в ответном письме или на вебинаре.</p>
  
  //   <div class="bottom">
  
  //     <svg width="52" height="51" viewBox="0 0 52 51" fill="none" xmlns="http://www.w3.org/2000/svg">
  //       <path d="M13.5569 10.1819L10.7342 16.4676H16.4211L13.5569 10.1819ZM18.5173 21.6851H8.6794L7.22654 24.6842H1V23.7804L12.2078 0.445312H14.9475L26.1967 23.7804V24.6842H19.9702L18.5173 21.6851Z" fill="#24B861"/>
  //       <path d="M38.0809 0.149414C43.1036 0.190497 48.3339 2.65547 49.5377 8.61248H43.2697C42.2319 6.55834 40.5923 5.73668 38.0809 5.73668C34.0544 5.73668 31.8958 8.73572 31.8958 12.3921C31.8958 16.336 34.3242 18.9653 38.0809 18.9653C40.6545 18.9653 42.2734 18.308 43.415 16.0485H38.1224V10.7488H49.9113C50.0566 13.1316 50.0566 15.4322 49.2056 17.7329C47.4207 22.7039 42.6885 24.6348 38.1016 24.6348C31.7713 24.6348 25.358 20.5676 25.3165 12.3921C25.3372 4.25769 31.7506 0.190497 38.0809 0.149414Z" fill="#24B861"/>
  //       <path d="M12.7852 26C17.8079 26.0411 23.0382 28.506 24.242 34.4631H17.974C16.9362 32.4089 15.2965 31.5873 12.7852 31.5873C8.75867 31.5873 6.60013 34.5863 6.60013 38.2427C6.60013 42.1866 9.02849 44.8159 12.7852 44.8159C15.3588 44.8159 16.9777 44.1586 18.1192 41.899H12.8059V36.5994H24.5949C24.7401 38.9822 24.7401 41.2828 23.8892 43.5834C22.1042 48.5545 17.3721 50.4854 12.7852 50.4854C6.45485 50.4854 0.0415103 46.4182 0 38.2427C0.0415103 30.0672 6.45485 26 12.7852 26Z" fill="#24B861"/>
  //       <path d="M45.0325 38.3865C45.0325 29.8002 32.5379 29.8002 32.5379 38.3865C32.5379 47.0549 45.0325 47.0549 45.0325 38.3865ZM26 38.3865C26 21.8712 51.5496 21.8712 51.5496 38.3865C51.5496 54.9428 26 54.9428 26 38.3865Z" fill="#24B861"/>
  //     </svg>
  
  //     <div class="bottom__right">
  
  //       <p><b>С уважением,<br> 
  //       команда AGGO</b></p>
          
  //       <p>Официальный реселлер Semrush<br>
  //       Компания «АГГО Групп»</p>
      
  //       <a href="mailto:semrush@aggo.ru">semrush@aggo.ru</a><br>
  //       <a href="tel:+78123893434">+7 (812) 389-34-34</a><br>
  //       <a href="www.aggo.ru">www.aggo.ru</a><br>
  //       <a href="semrush.aggo.ru">semrush.aggo.ru</a>
  
  //     </div>
  
  //   </div>
  
  // </body>
  // </html>
  // ';

  // if ($mail2 -> send()) {
  //   echo 'Сообщение отправлено';
  // } else {
  //   echo 'Ошибка, письмо не может быть отправлено: '.$mail2 -> ErrorInfo;
  // }


?>